long = 7
singer_name = ['1', '好', 'English', '~!@#$%^&*()_+<>:”{}|', 'NULL', '<input>', 'Π']
song_name = ['1', '好', 'English', '~!@#$%^&*()_+<>:”{}|', 'NULL', '<input>', 'Π']
limit = ['-1', '0', '1', '1.1', '9999', '10000', '10001']
page = ['-1', '0', '1', '1.1', '100000000000000000000000000000', 'e', 'Π']


dataList = {
    'singer_name': ['1', '好', 'English', '~!@#$%^&*()_+<>:”{}|', 'NULL', '<input>', 'Π'],
    'song_name':  ['1', '好', 'English', '~!@#$%^&*()_+<>:”{}|', 'NULL', '<input>', 'Π'],
    'limit': ['-1', '0', '1', '1.1', '9999', '10000', '10001'],
    'page': ['-1', '0', '1', '1.1', '100000000000000000000000000000', 'e', 'Π'],

    'title': ['1', '好', 'English', '~!@#$%^&*()_+<>:”{}|', 'NULL', '<input>', 'Π'],
    'description': ['1', '好', 'English', '~!@#$%^&*()_+<>:”{}|', 'NULL', '<input>', 'Π'],
    'big_picture': ['1', 'http://www.baidu.com', 'http://', '好', 'NULL', '<input>', 'Π'],
    'small_picture': ['1', 'http://www.baidu.com', 'http://', '好', 'NULL', '<input>', 'Π'],
    'active': ['0', '1', '0', '1', '0', '1', '0'],

    'sheet_type': ['1', '2', '1', '2', '1', '2', '1'],
    'use_type': ['0', '1', '2', '0', '1', '2', '0'],


}